docs/mini_eps.md

# &Iacute;ndice

1.  [Lista de mini-EPs](#orgdea55db)
    1.  [Computação & Ciência: mini-EP1](#orgbad9f8b)
    2.  [mini-EP2: Exercícios do Capítulo 1. O Caminho do Programa](#orgfc1f58e)
    3.  [mini-EP3: Exercícios do Capítulo 2. Variáveis, Expressões, e Instruções](#org2616ee2)



<a id="orgdea55db"></a>

# Lista de mini-EPs

Aqui você  encontra instruções e  informações sobre  os *mini-EPs*, que  devem ser
entregues no [PACA](https://paca.ime.usp.br/course/view.php?id=1448).

[Voltar para a Página Inicial](index.html)


<a id="orgbad9f8b"></a>

## Computação & Ciência: mini-EP1

[Voltar para Lista de mini-EPs](#orgdea55db)

1.  **Encontre** um exemplo de **pesquisa científica** que:
    1.  Desperte o **seu interesse**
    2.  Tenha sido **facilitado** ou **tornado possível** pela **computação moderna**
        1.  **Sensores**, **satélites**, **volume de dados**, **simulações**, &hellip;
2.  **Escreva um parágrafo** resumindo a pesquisa
    1.  Inclua **links** para a pesquisa
3.  **Entregue** no **PACA**. Alguns **pontos importantes**:
    1.  Formato do arquivo **deve ser `pdf`**
    2.  Nome do arquivo deve ser no formato `SEU_NOME_miniEP1.pdf`
    3.  Usar **corretor ortográfico**
    4.  Até a **próxima Sexta, 09/08**


<a id="orgfc1f58e"></a>

## mini-EP2: Exercícios do Capítulo 1. O Caminho do Programa

[Voltar para Lista de mini-EPs](#orgdea55db)

1.  Abra o Notebook do Capítulo 1 [aqui](https://phrb.github.io/PenseJulia/)
2.  Usando a **interface** do Notebook pelo **Binder**:
    1.  Faça os exercícios 1 & 2
3.  **Salve** seu trabalho
4.  Faça o **download do notebook com seu trabalho**
5.  Entregue seu Notebook no PACA
    1.  Formato do arquivo **deve ser `.ipynb`**
    2.  Nome do arquivo deve ser no formato `SEU_NOME_miniEP2.ipynb`
    3.  Até a **próxima Terça, 13/08**


<a id="org2616ee2"></a>

## mini-EP3: Exercícios do Capítulo 2. Variáveis, Expressões, e Instruções

1.  Abra o Notebook do Capítulo 2 [aqui](https://phrb.github.io/PenseJulia/), ou em sua **instalação local do Jupyter**
2.  Usando a **interface** do Notebook:
    1.  Faça **todos os items** do exercício 2.3
3.  **Salve** seu trabalho
4.  Se estiver usando o **Binder**, faça o **download do notebook com o seu trabalho**
5.  Entregue seu Notebook no PACA
    1.  O formato do arquivos **deve ser `.ipynb`, ou `.jl`**
    2.  O nome do arquivo deve ser no formato `Seu_Nome_miniEP3.ipynb` (exemplo: `Alfredo_Goldman_miniEP3.ipynb`)
    3.  A data de entrega é **Terça, 20/08**
